<?php


namespace App\classes;


class Blog
{
    public $blogs = [];

    public function __construct()
    {
        $this->blogs = [
            0=>[
                'id'=>1,
                'title'=>'চিনি এই আছে, এই নেই, দাম ইচ্ছেমতো',
                'image'=>'sugar.jpg',
                'description'=>'রাজধানীর খুচরা দোকানগুলোতে কখনো চিনি পাওয়া যাচ্ছে, কখনো পাওয়া যাচ্ছে না। বিক্রেতারা বলছেন, পাইকারি দোকান থেকে মাঝেমধ্যে তাঁরা চিনি পান। পরিমাণে অল্প। সেই চিনি দ্রুতই বিক্রি হয়ে যায়। ফলে বেশির ভাগ সময় দোকানে চিনি থাকে না।'
            ],
            1=>[
                'id'=>2,
                'title'=>'ড্রোন হামলার পর ইউক্রেন থেকে শস্য রপ্তানির চুক্তি স্থগিত রাশিয়ার',
                'image'=>'ukrain.jpg',
                'description'=>'কৃষ্ণসাগরের ক্রিমিয়া উপকূলে রুশ নৌবহরে ড্রোন হামলার পর ইউক্রেন থেকে শস্য রপ্তানির চুক্তি থেকে সরে দাঁড়িয়েছে রাশিয়া। গত ফেব্রুয়ারিতে যুদ্ধ শুরুর পর ইউক্রেনে উৎপাদিত শস্য রপ্তানি বন্ধ ছিল।'
            ],
            2=>[
                'id'=>3,
                'title'=>'ন্যাটো-রাশিয়ার ‘যুদ্ধ যুদ্ধ খেলায়’ পারমাণবিক যুদ্ধের আশঙ্কা',
                'image'=>'paromanobik.jpg',
                'description'=>'চলতি মাসেই যুক্তরাষ্ট্রের প্রেসিডেন্ট জো বাইডেন ভয় ধরিয়ে দেওয়ার মতো একটি কথা বলেছিলেন। তিনি বলেছিলেন, রাশিয়ার প্রেসিডেন্ট ভ্লাদিমির পুতিন যদি ইউক্রেনে পারমাণবিক হামলা চালান, তাহলে সবচেয়ে ভয়াবহ যুদ্ধটা শুরু হয়ে যেতে পারে। এই যুদ্ধ হবে ভালো ও মন্দের মধ্যে।'
            ]
        ];
    }

    public function getBlog()
    {
        return $this->blogs;
    }

    public function getBlogById($id)
    {
        foreach ($this->blogs as $blog)
        {
            if($blog['id'] == $id )
            {
                return $blog;
            }
        }
    }
}